{
    "info": {
        "firstName": "Michael",
        "lastName": "Zhang",
        "birthDate": "September 1998",
        "description": "Hey there, how are you doing?... You're probably wondering how you found yourself here. Well, it probably means I'm unemployed or looking for a new position. So, let me tell you a little about myself. I graduated back in 2021 amid COVID-19. I'm currently working as a Software Engineer for an AI-powered resource management software company called Mosaic (yes the logo is a copy of Polaroid's logo 😅). I do fun stuff like build new features and fix bugs (I KNOW SO FUN). I mainly work with React and Redux. Recently, I was moved on to the backend team and have been scouring StackOverflow for Rails help. During my free time (I don't have much right now) I enjoy weight lifting, playing video games, listening to music, and most importantly eating food. I hope this wall of text gives you the willpower to scroll down and look at the cool timeline."
    },
    "tags": [
        "Gamer",
        "Programmer",
        "Traveller",
        "Athlete"
    ],
    "socials": {
        "insta": "https://www.instagram.com/micoal.zg",
        "linkedin": "https://www.linkedin.com/in/michaelzg1998",
        "github": "https://www.github.com/micoalzg"
    },
    "timeline": [
        {
            "title": "Could be you",
            "type": "header"
        },
        {
            "company": "Mosaic",
            "startDate": "September 2021",
            "endDate": "September 2022",
            "position": "Software Engineer",
            "summary": "Built and maintained features providing information regarding the outlook of businesses. I started as a front-end developer, but was moved to the back-end mid 2022. On the front end I was responsible for building reusuable components with React and managing application state with Redux, I worked with middleware libraries such as redux-saga, and redux-thunk. On the backend I worked with Rails operating on a PostgresSQL server databases.",
            "type": "job"
        },
        {
            "company": "Accedo.tv",
            "startDate": "September 2019",
            "endDate": "September 2020",
            "position": "Software Engineer (Co-op)",
            "summary": "Worked on several JavaScript projects on connected devices such as Samsung, LG, Enseo, and Playstation. Developed an alert system for Apogee streaming application with AngularJs that is used by hundreds of schools across America. Ported Showtime OTT and Anytime appliction to Enseo and Playstation devices.",
            "type": "job"
        },
        {
            "title": "2019",
            "type": "sub-header"
        },
        {
            "company": "Ocean Sales, LLC",
            "startDate": "Augest 2017",
            "endDate": "September 2017",
            "position": "Sales Associate & Cashier",
            "summary": "Tasked with explaining RFID technology to customers. Performed demonstrations for customers. Interacted with customers, managed inventory and assembly of product.",
            "type": "job"
        },
        {
            "title": "2017",
            "type": "sub-header"
        },
        {
            "company": "Interatlantic Sales",
            "startDate": "Augest 2016",
            "endDate": "September 2016",
            "position": "Sales Associate & Cashier",
            "summary": "Performed product demonstrations for potential customers. Handled sale transactions. Achieved highest total sales among competitors.",
            "type": "job"
        }
    ],
    "skills": [
        {
            "name": "React",
            "experience": 94,
            "level": "Expert"
        },
        {
            "name": "JavaScript",
            "experience": 90.000,
            "level": "Advanced"
        },
        {
            "name": "Rails",
            "experience": 80.000,
            "level": "Intemediate - Advanced"
        },
        {
            "name": "Python",
            "experience": 80.000,
            "level": "Intemediate - Advanced"
        },
        {
            "name": "Java",
            "experience": 80.000,
            "level": "Intermediate"
        },
        {
            "name": "C",
            "experience": 30.000,
            "level": "Forgot but can pick back up"
        },
        {
            "name": "AngularJs",
            "experience": 30.000,
            "level": "Forgot but can pick back up"
        }
    ]
}